## Plan Result (prod-app-registrations)




<pre><code>Plan: 13 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee&#34;]
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3&#34;]
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/1fe7db01-9981-4ed3-983c-163dd50ba43a&#34;]
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2&#34;]
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/5709598c-3a1c-4535-8979-f10948b9a031&#34;]
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768&#34;]
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d&#34;]
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab&#34;]
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/b3394340-6c9f-44ca-aa3e-9ff38bd1f9ac&#34;]
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb&#34;]
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783&#34;]
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/cdc31e8e-43f4-4c8a-8b50-635e954c27d3&#34;]
  * module.this.azurerm_role_assignment.this[&#34;Sandbox Cleanup-Contributor-/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/0c1744f8-9e63-4742-9c28-c066fd2e6eee"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/1fe7db01-9981-4ed3-983c-163dd50ba43a"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/1fe7db01-9981-4ed3-983c-163dd50ba43a"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/5709598c-3a1c-4535-8979-f10948b9a031"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/5709598c-3a1c-4535-8979-f10948b9a031"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/681c247c-c695-4b87-b018-8756a0b8b19d"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/b3394340-6c9f-44ca-aa3e-9ff38bd1f9ac"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/b3394340-6c9f-44ca-aa3e-9ff38bd1f9ac"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/cdc31e8e-43f4-4c8a-8b50-635e954c27d3"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/cdc31e8e-43f4-4c8a-8b50-635e954c27d3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["Sandbox Cleanup-Contributor-/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c0579ea1-0637-4b45-bb30-c760c4cbe3e4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":26,"Program":"tfcmt","SHA1":"","Target":"prod-app-registrations","Vars":{}} -->